# Indlæsning af data
Denne notebook viser hvordan man kan indlæser data fra en fil lokalt på sin computer. 
Eksempel filen kan hentes fra [github](https://github.com/Rotendahl/studynow/blob/master/data/exampleCsv.csv)

In [1]:
import pandas as pd

In [8]:
data = pd.read_csv('exampleCsv.csv', sep=';')

In [9]:
data.head()

   alder køn  højde    navn
0   21.0   M    185  Torben
1   23.0   D    170  Amanda
2   25.0   M    192  Preben
3   19.0   D    168   Mette
4   26.0   D    173   Trine

In [4]:
data

   alder  køn  højde    navn
0   21.0    M    185  Torben
1   23.0    D    170  Amanda
2   25.0    M    192  Preben
3   19.0    D    168   Mette
4   26.0    D    173   Trine
5   22.0    M    181   Søren
6    NaN    M    188    Rune
7   26.0  NaN    190  Torben
8   29.0  NaN    172   Mette
9   19.0  NaN    180   Mette

In [5]:
data.describe()

           alder       højde
count   9.000000   10.000000
mean   23.333333  179.900000
std     3.427827    8.761659
min    19.000000  168.000000
25%    21.000000  172.250000
50%    23.000000  180.500000
75%    26.000000  187.250000
max    29.000000  192.000000

In [10]:
data.columns

Index(['alder', 'køn', 'højde', 'navn'], dtype='object')

In [12]:
data['køn']

0      M
1      D
2      M
3      D
4      D
5      M
6      M
7    NaN
8    NaN
9    NaN
Name: køn, dtype: object

In [13]:
data['køn'].value_counts()

M    4
D    3
Name: køn, dtype: int64

In [15]:
data['navn'].value_counts()

Mette     3
Torben    2
Amanda    1
Preben    1
Trine     1
Rune      1
Søren     1
Name: navn, dtype: int64

In [16]:
data['navn'].unique()

array(['Torben', 'Amanda', 'Preben', 'Mette', 'Trine', 'Søren', 'Rune'],
      dtype=object)

In [26]:
ages = data['alder']

In [27]:
ages

0    21.0
1    23.0
2    25.0
3    19.0
4    26.0
5    22.0
6     NaN
7    26.0
8    29.0
9    19.0
Name: alder, dtype: float64

In [29]:
type([1,2,3,4])

list

In [30]:
type(ages)

pandas.core.series.Series

In [38]:
ages.cumsum()

0     21.0
1     44.0
2     69.0
3     88.0
4    114.0
5    136.0
6      NaN
7    162.0
8    191.0
9    210.0
Name: alder, dtype: float64